sfagin89/Arigato_Crypto_Roboto/eink_firmware/experiments/frdmk64f_dspi_polling_b2b_transfer_master/board/pin_mux.c
/*
 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 ,2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v9.0
processor: MK64FN1M0xxx12
package_id: MK64FN1M0VLL12
mcu_data: ksdk2_0
processor_version: 9.0.0
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h" // added by santiago
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '62', peripheral: UART0, signal: RX, pin_signal: PTB16/SPI1_SOUT/UART0_RX/FTM_CLKIN0/FB_AD17/EWM_IN}
  - {pin_num: '63', peripheral: UART0, signal: TX, pin_signal: PTB17/SPI1_SIN/UART0_TX/FTM_CLKIN1/FB_AD16/EWM_OUT_b}
  - {pin_num: '93', peripheral: SPI0, signal: PCS0_SS, pin_signal: PTD0/LLWU_P12/SPI0_PCS0/UART2_RTS_b/FTM3_CH0/FB_ALE/FB_CS1_b/FB_TS_b}
  - {pin_num: '94', peripheral: SPI0, signal: SCK, pin_signal: ADC0_SE5b/PTD1/SPI0_SCK/UART2_CTS_b/FTM3_CH1/FB_CS0_b}
  - {pin_num: '95', peripheral: SPI0, signal: SOUT, pin_signal: PTD2/LLWU_P13/SPI0_SOUT/UART2_RX/FTM3_CH2/FB_AD4/I2C0_SCL}
  - {pin_num: '96', peripheral: SPI0, signal: SIN, pin_signal: PTD3/SPI0_SIN/UART2_TX/FTM3_CH3/FB_AD3/I2C0_SDA}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
	/****** Start Santiago Custom Code ******/

	/* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);

	/* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);

    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);

	/* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    gpio_pin_config_t EINK_LED_BLUE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB22 (pin 68)  */
    GPIO_PinInit(EINK_LED_BLUE_GPIO, EINK_LED_BLUE_PIN, &EINK_LED_BLUE_config);


	gpio_pin_config_t EINK_DC_config = {
	        .pinDirection = kGPIO_DigitalOutput,
	        .outputLogic = 0U // default is 0 because DC low means data interpreted as command
	};
	/* Initialize GPIO functionality on pin PTC4 (pin 76)  */
	GPIO_PinInit(EINK_DC_GPIO, EINK_DC_PIN, &EINK_DC_config);


	gpio_pin_config_t EINK_CS_config = {
		        .pinDirection = kGPIO_DigitalOutput,
		        .outputLogic = 1U
	};
	/* Initialize GPIO functionality on pin PTC3 (pin 73)  */
	GPIO_PinInit(EINK_CS_GPIO, EINK_CS_PIN, &EINK_CS_config);


	gpio_pin_config_t EINK_RST_config = {
	        .pinDirection = kGPIO_DigitalOutput,
	        .outputLogic = 1U
	};
	/* Initialize GPIO functionality on pin PTC12 (pin 84)  */
	GPIO_PinInit(EINK_RST_GPIO, EINK_RST_PIN, &EINK_RST_config);


	gpio_pin_config_t EINK_BUSY_config = {
	        .pinDirection = kGPIO_DigitalInput,
	        .outputLogic = 0U
	};
	/* Initialize GPIO functionality on pin PTE26 (pin 33)  */
	GPIO_PinInit(EINK_BUSY_GPIO, EINK_BUSY_PIN, &EINK_BUSY_config);

	/* PORTB (pin 67) is configured as PTC4 */
	PORT_SetPinMux(EINK_LED_BLUE_PORT, EINK_LED_BLUE_PIN, kPORT_MuxAsGpio);

	/* PORTC4 (pin 76) is configured as PTC4 */
	PORT_SetPinMux(EINK_DC_PORT, EINK_DC_PIN, kPORT_MuxAsGpio);

	/* PORTC3 (pin 73) is configured as PTC3 */
	PORT_SetPinMux(EINK_CS_PORT, EINK_CS_PIN, kPORT_MuxAsGpio);

	/* PORTC12 (pin 84) is configured as PTC12 */
	PORT_SetPinMux(EINK_RST_PORT, EINK_RST_PIN, kPORT_MuxAsGpio);

	/* PORTE26 (pin 33) is configured as PTE26 */
	PORT_SetPinMux(EINK_BUSY_PORT, EINK_BUSY_PIN, kPORT_MuxAsGpio);


	/****** End Santiago Custom Code ******/


    /* PORTB16 (pin 62) is configured as UART0_RX */
    PORT_SetPinMux(PORTB, 16U, kPORT_MuxAlt3);

    /* PORTB17 (pin 63) is configured as UART0_TX */
    PORT_SetPinMux(PORTB, 17U, kPORT_MuxAlt3);

    /* PORTD0 (pin 93) is configured as SPI0_PCS0 */
    PORT_SetPinMux(PORTD, 0U, kPORT_MuxAlt2);

    /* PORTD1 (pin 94) is configured as SPI0_SCK */
    PORT_SetPinMux(PORTD, 1U, kPORT_MuxAlt2);

    /* PORTD2 (pin 95) is configured as SPI0_SOUT */
    PORT_SetPinMux(PORTD, 2U, kPORT_MuxAlt2);

    /* PORTD3 (pin 96) is configured as SPI0_SIN */
    PORT_SetPinMux(PORTD, 3U, kPORT_MuxAlt2);

    SIM->SOPT5 = ((SIM->SOPT5 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT5_UART0TXSRC_MASK)))

                  /* UART 0 transmit data source select: UART0_TX pin. */
                  | SIM_SOPT5_UART0TXSRC(SOPT5_UART0TXSRC_UART_TX));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
